public class Task1_3_4_3 {
    public static void main(String[] args) {
        System.out.println("Задание: \n3.  Когда стоит использовать слово this?\n\nРешение: ");
        System.out.println("Ключевое слово this стоит использовать при необходимости " +
                "\nобращаться к полям класса, если в этом же блоке кода имеются локальные " +
                "\nпеременные с теми же самыми именами, как и у полей класса. Также this " +
                "\nиспользуется для обращения к полям или методам из внутреннего класса к полям " +
                "\nили методам обрамляющего класса имеющим такие же имена, как и у внутреннего. " +
                "\nТа же самая причина использования this для вложенных вызовов конструкторов классов.");

    }
}