public class Task1_3_4_1 {
    public static void main(String[] args) {
        System.out.println("Задание: \n1.  Зачем нужно ключевое слово this?\n\nРешение: ");
        System.out.println("Ключевое слово this – используется для ссылки на текущий класс с учетом метода \n" +
                "или конструктора экземпляра. Используя this в Java, можно ссылаться на экземпляры \n" +
                "класса, такие как конструкторы, переменные и методы. Ключевое слово this используется \n" +
                "только в составе методов либо конструкторов экземпляра.");

    }
}